<h1>Содержание<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Импорт-данных" data-toc-modified-id="Импорт-данных-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Импорт данных</a></span></li><li><span><a href="#Предобработка-данных-с-помощью-sql" data-toc-modified-id="Предобработка-данных-с-помощью-sql-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Предобработка данных с помощью sql</a></span></li><li><span><a href="#Select" data-toc-modified-id="Select-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Select</a></span><ul class="toc-item"><li><span><a href="#Псевдонимы" data-toc-modified-id="Псевдонимы-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Псевдонимы</a></span></li><li><span><a href="#Действия-со-столбцами" data-toc-modified-id="Действия-со-столбцами-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Действия со столбцами</a></span></li><li><span><a href="#Where" data-toc-modified-id="Where-3.3"><span class="toc-item-num">3.3&nbsp;&nbsp;</span>Where</a></span></li><li><span><a href="#Like" data-toc-modified-id="Like-3.4"><span class="toc-item-num">3.4&nbsp;&nbsp;</span>Like</a></span></li><li><span><a href="#Case-+-AVG" data-toc-modified-id="Case-+-AVG-3.5"><span class="toc-item-num">3.5&nbsp;&nbsp;</span>Case + AVG</a></span></li></ul></li><li><span><a href="#Create-table" data-toc-modified-id="Create-table-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Create table</a></span><ul class="toc-item"><li><span><a href="#Create-table-postgres" data-toc-modified-id="Create-table-postgres-4.1"><span class="toc-item-num">4.1&nbsp;&nbsp;</span>Create table postgres</a></span></li></ul></li><li><span><a href="#Union-all" data-toc-modified-id="Union-all-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>Union all</a></span></li><li><span><a href="#Специальные-функции" data-toc-modified-id="Специальные-функции-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Специальные функции</a></span></li><li><span><a href="#Group-by" data-toc-modified-id="Group-by-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>Group by</a></span><ul class="toc-item"><li><span><a href="#Сводная-таблица" data-toc-modified-id="Сводная-таблица-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>Сводная таблица</a></span></li><li><span><a href="#Интервалы-(бины/бакеты)" data-toc-modified-id="Интервалы-(бины/бакеты)-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>Интервалы (бины/бакеты)</a></span></li><li><span><a href="#Категории-из-текстовых-данных" data-toc-modified-id="Категории-из-текстовых-данных-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>Категории из текстовых данных</a></span></li></ul></li><li><span><a href="#Подзапросы" data-toc-modified-id="Подзапросы-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Подзапросы</a></span><ul class="toc-item"><li><span><a href="#Обычный-подзапрос" data-toc-modified-id="Обычный-подзапрос-8.1"><span class="toc-item-num">8.1&nbsp;&nbsp;</span>Обычный подзапрос</a></span></li><li><span><a href="#CTE-(WITH)" data-toc-modified-id="CTE-(WITH)-8.2"><span class="toc-item-num">8.2&nbsp;&nbsp;</span>CTE (WITH)</a></span></li></ul></li><li><span><a href="#Джойны" data-toc-modified-id="Джойны-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Джойны</a></span><ul class="toc-item"><li><span><a href="#Left-JOIN-/-INNER-JOIN" data-toc-modified-id="Left-JOIN-/-INNER-JOIN-9.1"><span class="toc-item-num">9.1&nbsp;&nbsp;</span>Left JOIN / INNER JOIN</a></span></li><li><span><a href="#Джойн-таблицы-самой-на-себя-(нарастающий-итог)" data-toc-modified-id="Джойн-таблицы-самой-на-себя-(нарастающий-итог)-9.2"><span class="toc-item-num">9.2&nbsp;&nbsp;</span>Джойн таблицы самой на себя (нарастающий итог)</a></span></li><li><span><a href="#Ежемесячный-отчет-на-пользователя" data-toc-modified-id="Ежемесячный-отчет-на-пользователя-9.3"><span class="toc-item-num">9.3&nbsp;&nbsp;</span>Ежемесячный отчет на пользователя</a></span></li></ul></li><li><span><a href="#Оконные-функции" data-toc-modified-id="Оконные-функции-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Оконные функции</a></span><ul class="toc-item"><li><span><a href="#Пример-оконной-функции" data-toc-modified-id="Пример-оконной-функции-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Пример оконной функции</a></span></li><li><span><a href="#Rank-и-Row_number¶" data-toc-modified-id="Rank-и-Row_number¶-10.2"><span class="toc-item-num">10.2&nbsp;&nbsp;</span>Rank и Row_number¶</a></span></li><li><span><a href="#Поиск-топ-3-зарплаты-в-отделе-с-помощью--DENSE_RANK()" data-toc-modified-id="Поиск-топ-3-зарплаты-в-отделе-с-помощью--DENSE_RANK()-10.3"><span class="toc-item-num">10.3&nbsp;&nbsp;</span>Поиск топ-3 зарплаты в отделе с помощью  DENSE_RANK()</a></span></li><li><span><a href="#Работа-с-клиентскими-сессиями-с-помощью-LAG()" data-toc-modified-id="Работа-с-клиентскими-сессиями-с-помощью-LAG()-10.4"><span class="toc-item-num">10.4&nbsp;&nbsp;</span>Работа с клиентскими сессиями с помощью LAG()</a></span></li><li><span><a href="#Скользящее-среднее" data-toc-modified-id="Скользящее-среднее-10.5"><span class="toc-item-num">10.5&nbsp;&nbsp;</span>Скользящее среднее</a></span></li></ul></li></ul></div>

# SQL для анализа данных

# Описание проекта:

Необходимо проанализировать датасет со свойствами и характеристиками алмазов "Diamonds", взятый из открытых источников "Kaggle".

Покажем применение самых распространенных и базовых комманд SQL c использованием легковесной встраиваемой СУБД SQLite.

## Импорт данных

Описание данных:

+ `price` - цена алмаза в USD 
+ `carat` - вес алмаза в каратах 

+ `cut` -  качество резания (Fair, Good, Very Good, Premium, Ideal)

+ `color` - цвет алмаза, от J (худший) до D (лучший)

+ `clarity` -  чистота алмаза (I1 (худшая), SI2, SI1, VS2, VS1, VVS2, VVS1, IF (лучшая))

+ `x` -  длина в mm 

+ `y` -  ширина в mm 

+ `z` - глубина в mm 

+ `depth` -  процент глубины = z / mean(x, y) = 2 * z / (x + y)  (43-79)

+ `table` -  ширина верхней части алмаза относительно самой широкой точки

Импорт библиотек для работы:

In [1]:
import pandas as pd
import numpy as np

In [2]:
import sqlite3

In [3]:
# проверка версии SQLite

sqlite3.sqlite_version

'3.38.2'

In [4]:
# создание соединения с БД  SQLite:

con = sqlite3.connect('db')

Рассмотрим датасет:

In [5]:
df = pd.read_csv('./diamonds.csv' )

In [6]:
df.describe()

,Unnamed: 0,carat,depth,table,price,x,y,z
count,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000,53940.000000
mean,26970.500000,0.797940,61.749405,57.457184,3932.799722,5.731157,5.734526,3.538734
std,15571.281097,0.474011,1.432621,2.234491,3989.439738,1.121761,1.142135,0.705699
min,1.000000,0.200000,43.000000,43.000000,326.000000,0.000000,0.000000,0.000000
25%,13485.750000,0.400000,61.000000,56.000000,950.000000,4.710000,4.720000,2.910000
50%,26970.500000,0.700000,61.800000,57.000000,2401.000000,5.700000,5.710000,3.530000
75%,40455.250000,1.040000,62.500000,59.000000,5324.250000,6.540000,6.540000,4.040000
max,53940.000000,5.010000,79.000000,95.000000,18823.000000,10.740000,58.900000,31.800000

In [7]:
df.head(15)

,Unnamed: 0,carat,cut,color,clarity,depth,table,price,x,y,z
0,1,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43
1,2,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31
2,3,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31
3,4,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63
4,5,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75
5,6,0.24,Very Good,J,VVS2,62.8,57.0,336,3.94,3.96,2.48
6,7,0.24,Very Good,I,VVS1,62.3,57.0,336,3.95,3.98,2.47
7,8,0.26,Very Good,H,SI1,61.9,55.0,337,4.07,4.11,2.53
8,9,0.22,Fair,E,VS2,65.1,61.0,337,3.87,3.78,2.49
9,10,0.23,Very Good,H,VS1,59.4,61.0,338,4.00,4.05,2.39
10,11,0.30,Good,J,SI1,64.0,55.0,339,4.25,4.28,2.73
11,12,0.23,Ideal,J,VS1,62.8,56.0,340,3.93,3.90,2.46
12,13,0.22,Premium,F,SI1,60.4,61.0,342,3.88,3.84,2.33
13,14,0.31,Ideal,J,SI2,62.2,54.0,344,4.35,4.37,2.71
14,15,0.20,Premium,E,SI2,60.2,62.0,345,3.79,3.75,2.27

In [8]:
# Удалим столбец "Unnamed: 0", как не несущий полезной информации:

df.drop('Unnamed: 0', axis=1, inplace=True)
df.head(5)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [9]:
df.dtypes

carat      float64
cut         object
color       object
clarity     object
depth      float64
table      float64
price        int64
x          float64
y          float64
z          float64
dtype: object

## Предобработка данных с помощью sql

Проверим на пропуски исходную таблицу pandas:

In [10]:
for index, row in df.iterrows():
    # проверяем каждую ячейку в текущей строке на пропуск
    for column_name, cell_value in row.items():
        if pd.isna(cell_value):
            print(f"Пропуск в колонке '{column_name}' на индексе {index}")

Пропусков в нашей таблице нет...
Но если бы они были, то можно было бы проверить столбец с пропусками, используя сиквел запрос, следующим образом:

```
sql = 
SELECT COUNT(d.проверяемый_столбец),
count(*) 
FROM название_датафрейма AS d;

```

код  ```COUNT(d.проверяемый_столбец)``` вернет кол-во НЕНУЛЕВЫХ значений в проверяемом столбце,</br>
а код ```count(*)``` вернет ОБЩЕЕ КОЛ-ВО ЗАПИСЕЙ, ВКЛЮЧАЯ ПРОПУСКИ.

Проверим на дубликаты:

In [11]:
duplicates = df[df.duplicated()]

print(duplicates)

       carat    cut color clarity  depth  table  price     x     y     z
1005    0.79  Ideal     G     SI1   62.3   57.0   2898  5.90  5.85  3.66
1006    0.79  Ideal     G     SI1   62.3   57.0   2898  5.90  5.85  3.66
1007    0.79  Ideal     G     SI1   62.3   57.0   2898  5.90  5.85  3.66
1008    0.79  Ideal     G     SI1   62.3   57.0   2898  5.90  5.85  3.66
2025    1.52   Good     E      I1   57.3   58.0   3105  7.53  7.42  4.28
...      ...    ...   ...     ...    ...    ...    ...   ...   ...   ...
47969   0.52  Ideal     D     VS2   61.8   55.0   1919  5.19  5.16  3.20
49326   0.51  Ideal     F    VVS2   61.2   56.0   2093  5.17  5.19  3.17
49557   0.71   Good     F     SI2   64.1   60.0   2130  0.00  0.00  0.00
50079   0.51  Ideal     F    VVS2   61.2   56.0   2203  5.19  5.17  3.17
52861   0.50   Fair     E     VS2   79.0   73.0   2579  5.21  5.18  4.09

[146 rows x 10 columns]

Удалим дубликаты:

In [12]:
df.drop_duplicates(keep='first', inplace=True)

сохраним датафрейм в БД :

In [13]:
df.to_sql('diamonds_for_sql', con, index=False, if_exists='replace')

53794

## Select

### Псевдонимы

In [14]:
# переведем таблицу в БД sqlite:

df.to_sql('diamonds_for_sql', con, index=False, if_exists='replace')

53794

In [15]:
# функция вывода рез-тата запроса sql:

def select(sql):
    return pd.read_sql(sql, con)

In [16]:
sql = '''SELECT ROUND(d.x * d.y * d.z) AS volume,
       ROUND(AVG(d.carat), 1) AS carat,
       d.clarity
       FROM diamonds_for_sql AS d
       GROUP BY  d.clarity
    
'''

In [17]:
select(sql)

   volume  carat clarity
0    52.0    1.3      I1
1    85.0    0.5      IF
2    35.0    0.9     SI1
3    38.0    1.1     SI2
4    38.0    0.7     VS1
5    47.0    0.8     VS2
6    39.0    0.5    VVS1
7    39.0    0.6    VVS2

### Действия со столбцами

In [18]:
sql = '''
SELECT d.*, 
ROUND(d.x * d.y * d.z) AS volume,
ROUND(d.price/d.carat, 2) AS price_per_carat,
ROUND(d.price/(d.x * d.y * d.z),2) AS price_per_volume,
ROUND(d.depth) AS depth_round

FROM diamonds_for_sql AS d
LIMIT 10
'''

In [19]:
select(sql)

,carat,cut,color,clarity,depth,table,price,x,y,z,volume,price_per_carat,price_per_volume,depth_round
0,0.23,Ideal,E,SI2,61.5,55.0,326,3.95,3.98,2.43,38.0,1417.39,8.53,62.0
1,0.21,Premium,E,SI1,59.8,61.0,326,3.89,3.84,2.31,35.0,1552.38,9.45,60.0
2,0.23,Good,E,VS1,56.9,65.0,327,4.05,4.07,2.31,38.0,1421.74,8.59,57.0
3,0.29,Premium,I,VS2,62.4,58.0,334,4.20,4.23,2.63,47.0,1151.72,7.15,62.0
4,0.31,Good,J,SI2,63.3,58.0,335,4.34,4.35,2.75,52.0,1080.65,6.45,63.0
5,0.24,Very Good,J,VVS2,62.8,57.0,336,3.94,3.96,2.48,39.0,1400.00,8.68,63.0
6,0.24,Very Good,I,VVS1,62.3,57.0,336,3.95,3.98,2.47,39.0,1400.00,8.65,62.0
7,0.26,Very Good,H,SI1,61.9,55.0,337,4.07,4.11,2.53,42.0,1296.15,7.96,62.0
8,0.22,Fair,E,VS2,65.1,61.0,337,3.87,3.78,2.49,36.0,1531.82,9.25,65.0
9,0.23,Very Good,H,VS1,59.4,61.0,338,4.00,4.05,2.39,39.0,1469.57,8.73,59.0

### Where

In [20]:
# вывод первых 5 строк датафрейма с помощью sql:

sql = ''' select * from diamonds_for_sql d limit 5'''
select(sql)

   carat      cut color clarity  depth  table  price     x     y     z
0   0.23    Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1   0.21  Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2   0.23     Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3   0.29  Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4   0.31     Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75

In [21]:
# подсчет кол-ва значений, удовлетворящих условию

sql = '''
SELECT COUNT()
FROM diamonds_for_sql AS d 
WHERE d.price BETWEEN 400 AND 500
'''

In [22]:
select(sql)

   COUNT()
0     1499

In [23]:
# уще один пример использования запроса с WHERE + сортировка:
sql = '''
SELECT *
FROM diamonds_for_sql AS d 
WHERE d.price BETWEEN 400 AND 500
AND d.clarity IN ('VVS1', 'IF')
ORDER BY d.price DESC, d.carat ASC
LIMIT 10;
'''

In [24]:
select(sql)

   carat        cut color clarity  depth  table  price     x     y     z
0   0.23  Very Good     E    VVS1   60.8   56.0    499  3.94  3.99  2.41
1   0.24       Good     E    VVS1   63.8   56.0    499  3.95  3.98  2.53
2   0.23       Good     E    VVS1   56.3   62.0    498  4.10  4.11  2.31
3   0.25       Good     E    VVS1   61.4   62.0    498  4.03  4.05  2.48
4   0.27       Good     F    VVS1   61.7   61.0    498  4.10  4.14  2.54
5   0.32      Ideal     J    VVS1   62.3   54.0    494  4.41  4.43  2.75
6   0.32      Ideal     J    VVS1   60.8   56.0    494  4.47  4.48  2.72
7   0.23  Very Good     E    VVS1   62.0   58.0    492  3.92  3.95  2.44
8   0.23  Very Good     D    VVS1   61.3   61.0    492  3.94  3.99  2.43
9   0.23  Very Good     E      IF   59.9   58.0    492  3.98  4.03  2.40

### Like

In [25]:
# Создадим собственный датафрейм:
t = pd.DataFrame({
    'id': [1389, 1546, 1217, 1413, 1259],
    'purpose': [
        'путешествие', 'на путешествие', 'путешествовать', 'поездка',
        'на возвращение 2009'
    ],
    'amount': [2000, 800, 500, 400, 1200]
})

In [26]:
t

     id              purpose  amount
0  1389          путешествие    2000
1  1546       на путешествие     800
2  1217       путешествовать     500
3  1413              поездка     400
4  1259  на возвращение 2009    1200

In [27]:
t.to_sql('purpose', con, index=False, if_exists='replace')

5

In [28]:
sql = '''
SELECT *
FROM purpose AS t
'''

In [29]:
select(sql)

     id              purpose  amount
0  1389          путешествие    2000
1  1546       на путешествие     800
2  1217       путешествовать     500
3  1413              поездка     400
4  1259  на возвращение 2009    1200

In [30]:
sql = '''
SELECT *
FROM purpose as t
WHERE (t.purpose LIKE '%путешеств%'
OR t.purpose LIKE '%поезд%')
AND t.amount > 800
'''

In [31]:
select(sql)

     id      purpose  amount
0  1389  путешествие    2000

### Case + AVG

In [32]:
#создание флагов двумя способами: через CASE и IIF(тернарный оператор в SQL):

sql = '''SELECT d.price,
CASE
    WHEN d.price > 400 THEN 1 ELSE 0
END AS greater_400_flag,
IIF(d.price > 400, 1, 0) AS greater_400_flag2
FROM diamonds_for_sql AS d
'''

In [33]:
select(sql)

       price  greater_400_flag  greater_400_flag2
0        326                 0                  0
1        326                 0                  0
2        327                 0                  0
3        334                 0                  0
4        335                 0                  0
...      ...               ...                ...
53789   2757                 1                  1
53790   2757                 1                  1
53791   2757                 1                  1
53792   2757                 1                  1
53793   2757                 1                  1

[53794 rows x 3 columns]

In [34]:
# нахождение среднего:

sql = '''
SELECT 
    AVG(CASE WHEN d.price > 400 THEN 1 ELSE 0 END) AS greater_400_frac
FROM 
    diamonds_for_sql d
 '''

In [35]:
select(sql)

   greater_400_frac
0          0.995353

## Create table

In [36]:
sql = '''
SELECT *
FROM diamonds_for_sql AS d
WHERE d.price > 1000
'''

In [37]:
select(sql)

       carat        cut color clarity  depth  table  price     x     y     z
0       0.70      Ideal     E     SI1   62.5   57.0   2757  5.70  5.72  3.57
1       0.86       Fair     E     SI2   55.1   69.0   2757  6.45  6.33  3.52
2       0.70      Ideal     G     VS2   61.6   56.0   2757  5.70  5.67  3.50
3       0.71  Very Good     E     VS2   62.4   57.0   2759  5.68  5.73  3.56
4       0.78  Very Good     G     SI2   63.8   56.0   2759  5.81  5.85  3.72
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
39319   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
39320   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
39321   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
39322   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
39323   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[39324 rows x 10 columns]

In [38]:
# Создадим объект курсра с соеднинением con:

cur = con.cursor()

In [39]:
# создадим таблицу из существующей:

sql = '''
DROP TABLE IF EXISTS greater_1000_price;
CREATE TABLE greater_1000_price AS
SELECT * FROM diamonds_for_sql AS d
WHERE d.price > 1000;
'''

In [40]:
# метод для выполнения сразу нескольких запросов sql:

cur.executescript(sql)

In [41]:
sql = '''SELECT * FROM greater_1000_price d
'''

In [42]:
select(sql)

       carat        cut color clarity  depth  table  price     x     y     z
0       0.70      Ideal     E     SI1   62.5   57.0   2757  5.70  5.72  3.57
1       0.86       Fair     E     SI2   55.1   69.0   2757  6.45  6.33  3.52
2       0.70      Ideal     G     VS2   61.6   56.0   2757  5.70  5.67  3.50
3       0.71  Very Good     E     VS2   62.4   57.0   2759  5.68  5.73  3.56
4       0.78  Very Good     G     SI2   63.8   56.0   2759  5.81  5.85  3.72
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
39319   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
39320   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
39321   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
39322   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
39323   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[39324 rows x 10 columns]

### Create table postgres

In [43]:
!pip install psycopg2

from sqlalchemy import create_engine

con_pg_my = create_engine(
    'postgresql+psycopg2://yoigwjca:OcteW6XlpQgIhSp0ijBCkKjh_NnM7n8l@snuffleupagus.db.elephantsql.com/yoigwjca'
)

Requirement already satisfied: psycopg2 in c:\users\user\anaconda3\lib\site-packages (2.9.9)

In [44]:
df.to_sql('diamonds_for_sql', con_pg_my, index=False, if_exists='replace')

794

In [45]:
# ф-ия выполнения sql-запроса:

def select_pg(sql):
    return pd.read_sql(sql, con_pg_my)

In [46]:
sql = '''SELECT *
        FROM diamonds_for_sql AS d
        WHERE d.price > 1000
'''

In [47]:
select_pg(sql)

       carat        cut color clarity  depth  table  price     x     y     z
0       0.70      Ideal     E     SI1   62.5   57.0   2757  5.70  5.72  3.57
1       0.86       Fair     E     SI2   55.1   69.0   2757  6.45  6.33  3.52
2       0.70      Ideal     G     VS2   61.6   56.0   2757  5.70  5.67  3.50
3       0.71  Very Good     E     VS2   62.4   57.0   2759  5.68  5.73  3.56
4       0.78  Very Good     G     SI2   63.8   56.0   2759  5.81  5.85  3.72
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
39319   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
39320   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
39321   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
39322   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
39323   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[39324 rows x 10 columns]

In [48]:
# второй вариант создания таблицы posgresql:

sql = '''
drop table if exists greater_1000_price;
create table greater_1000_price as
select * from diamonds_for_sql d
where d.price > 1000'''

In [49]:
# отправление запроса sql в БД postgresql через соединение con_pg_my:

con_pg_my.execute(sql)

In [50]:
sql = '''select * from greater_1000_price d'''

In [51]:
select_pg(sql)

       carat        cut color clarity  depth  table  price     x     y     z
0       0.70      Ideal     E     SI1   62.5   57.0   2757  5.70  5.72  3.57
1       0.86       Fair     E     SI2   55.1   69.0   2757  6.45  6.33  3.52
2       0.70      Ideal     G     VS2   61.6   56.0   2757  5.70  5.67  3.50
3       0.71  Very Good     E     VS2   62.4   57.0   2759  5.68  5.73  3.56
4       0.78  Very Good     G     SI2   63.8   56.0   2759  5.81  5.85  3.72
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
39319   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
39320   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
39321   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
39322   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
39323   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[39324 rows x 10 columns]

## Union all

In [52]:
# создадим 2 таблицы:

may = pd.DataFrame({'month':['may','may'],'revenue':[1,3]})
june = pd.DataFrame({'month':['june','june'],'revenue':[1,3]})
may

  month  revenue
0   may        1
1   may        3

In [53]:
june

  month  revenue
0  june        1
1  june        3

In [54]:
# перевод таблиц пандас в базу данных sql:

may.to_sql('may', con, index=False, if_exists='replace')
june.to_sql('june', con, index=False, if_exists='replace')

2

In [55]:
sql = '''select * from may t
union all
select * from june t'''

In [56]:
select(sql)

  month  revenue
0   may        1
1   may        3
2  june        1
3  june        3

In [57]:
# поменяем месяц во второй таблице в процессе выполнения запроса:

sql = '''
SELECT t.revenue,
       'may' AS month
FROM may as t
UNION ALL
SELECT t.revenue,
       'aug' AS month
FROM june t
'''

In [58]:
select(sql)

   revenue month
0        1   may
1        3   may
2        1   aug
3        3   aug

## Специальные функции

In [59]:
# извлечем подстроку из строки двумя разными функцмями:

sql = '''
SELECT d.cut,
       SUBSTRING(d.cut, 1, 1) AS substring_result,
       LEFT(d.cut, 1) AS left_result
FROM
  diamonds_for_sql AS d
  '''

In [60]:
select_pg(sql)

             cut substring_result left_result
0          Ideal                I           I
1        Premium                P           P
2           Good                G           G
3        Premium                P           P
4           Good                G           G
...          ...              ...         ...
53789      Ideal                I           I
53790       Good                G           G
53791  Very Good                V           V
53792    Premium                P           P
53793      Ideal                I           I

[53794 rows x 3 columns]

## Group by

### Сводная таблица

In [61]:
sql = '''
SELECT d.cut,
       COUNT(*) AS count,
       ROUND(AVG(d.price), 2) AS avg_price
FROM
    diamonds_for_sql AS d
GROUP BY 
    d.cut
'''
select(sql)

         cut  count  avg_price
0       Fair   1598    4341.95
1       Good   4891    3919.12
2      Ideal  21488    3462.75
3    Premium  13748    4583.50
4  Very Good  12069    3981.02

In [62]:
# сравним с обычной группровкой pandas:

df.groupby('cut')['price'].agg(['count','mean'])

           count         mean
cut
Fair        1598  4341.954318
Good        4891  3919.121039
Ideal      21488  3462.749953
Premium    13748  4583.501891
Very Good  12069  3981.016157

In [63]:
# подсчет уникальных и значений в `color` и общего их числа:

sql = '''
SELECT 
    COUNT(DISTINCT d.color) AS distinct_color,
    COUNT (d.color) AS tot_color
FROM 
    diamonds_for_sql AS d

'''
select(sql)

   distinct_color  tot_color
0               7      53794

In [64]:
# сгруппируем таблицу по столбцу `color`:

sql = '''
SELECT
    d.color,
    COUNT(*) as cnt,
    ROUND(AVG(d.price), 2) AS price_avg
FROM diamonds_for_sql d
GROUP BY d.color
ORDER BY price_avg DESC;
'''

select(sql)

  color    cnt  price_avg
0     J   2802    5326.42
1     I   5407    5081.75
2     H   8272    4482.86
3     G  11262    4001.35
4     F   9520    3726.75
5     D   6755    3174.44
6     E   9776    3079.61

### Интервалы (бины/бакеты)

In [65]:
# кол-во уникальных стоимостей алмазов в датасете:

sql = '''
SELECT
COUNT(distinct d.price)
FROM diamonds_for_sql d
'''

In [66]:
select(sql)

   COUNT(distinct d.price)
0                    11602

In [67]:
# создадим группы по стоимости:

sql = '''
SELECT
  d.price,
  CASE
    WHEN d.price < 1000 THEN '1. <1000'
    WHEN d.price < 2000 THEN '2. 1000-2000'
    WHEN d.price < 3000 THEN '3. 2000-3000'
    WHEN d.price >= 3000 THEN '4. >= 3000'
    ELSE 'other'
  END AS price_bin
FROM
  diamonds_for_sql d
  ORDER BY RANDOM() 
LIMIT 15;
'''

In [68]:
select(sql)

    price     price_bin
0     698      1. <1000
1    7154    4. >= 3000
2     505      1. <1000
3    3053    4. >= 3000
4    3597    4. >= 3000
5    1702  2. 1000-2000
6    3350    4. >= 3000
7     418      1. <1000
8    4535    4. >= 3000
9    1211  2. 1000-2000
10   3064    4. >= 3000
11   4327    4. >= 3000
12   4612    4. >= 3000
13    698      1. <1000
14   4900    4. >= 3000

In [69]:
# подсчитаем количество записей в каждой категории с помощью функции count(1):

sql = '''SELECT 

CASE
    WHEN d.price < 1000 THEN '1. <1000'
    WHEN d.price < 2000 THEN '2. 1000-2000' 
    WHEN d.price < 3000 THEN '3. 2000-3000'
    WHEN d.price >= 3000 THEN '4. >= 3000'
    ELSE 'other' END AS price_amount_bin,
COUNT(1) AS price_cnt
FROM diamonds_for_sql d
GROUP BY 1
 '''

In [70]:
select(sql)

  price_amount_bin  price_cnt
0         1. <1000      14445
1     2. 1000-2000       9678
2     3. 2000-3000       6123
3       4. >= 3000      23548

### Категории из текстовых данных

In [157]:
# Создадим датафрейм 

data = pd.DataFrame({'purpose': ['машина', 'машина', 'машина', 'на машину', 'купить авто',
                              'автомобиль', 'возвратить в 2023',
                              'на свадьбу', 'свадьба', 'свадьба', 'свадьба', 'для свадьбы',
                              'недвижимость', 'покупка недвижимости']})

In [158]:
data

                 purpose
0                 машина
1                 машина
2                 машина
3              на машину
4            купить авто
5             автомобиль
6      возвратить в 2023
7             на свадьбу
8                свадьба
9                свадьба
10               свадьба
11           для свадьбы
12          недвижимость
13  покупка недвижимости

In [159]:
data.to_sql('purpose', con, index=False, if_exists='replace')

14

In [160]:
# то же самое при помощи sql:
sql = '''
SELECT * 
FROM purpose t
'''

select(sql)

                 purpose
0                 машина
1                 машина
2                 машина
3              на машину
4            купить авто
5             автомобиль
6      возвратить в 2023
7             на свадьбу
8                свадьба
9                свадьба
10               свадьба
11           для свадьбы
12          недвижимость
13  покупка недвижимости

In [161]:
# подсчет кол-ва категорий:

sql = '''
SELECT
t.purpose,
count(1)
FROM purpose t
GROUP BY t.purpose
ORDER BY COUNT(1) DESC

'''

select(sql)

                purpose  count(1)
0               свадьба         3
1                машина         3
2  покупка недвижимости         1
3          недвижимость         1
4            на свадьбу         1
5             на машину         1
6           купить авто         1
7           для свадьбы         1
8     возвратить в 2023         1
9            автомобиль         1

In [162]:
# группировка одинаковых по смыслу целей:

cat = '''
SELECT t.purpose,

CASE
WHEN t.purpose LIKE '%свадьб%' THEN 'свадьба'
WHEN t.purpose LIKE '%машин%' OR t.purpose like '%авто%' THEN 'машина'
WHEN t.purpose LIKE '%недвиж%' THEN 'недвижимость'

ELSE 'другое' END AS purpose_cat

FROM purpose t
'''

select(cat)

                 purpose   purpose_cat
0                 машина        машина
1                 машина        машина
2                 машина        машина
3              на машину        машина
4            купить авто        машина
5             автомобиль        машина
6      возвратить в 2023        другое
7             на свадьбу       свадьба
8                свадьба       свадьба
9                свадьба       свадьба
10               свадьба       свадьба
11           для свадьбы       свадьба
12          недвижимость  недвижимость
13  покупка недвижимости  недвижимость

In [163]:
# подсчет кол-ва соответствующих категорий:

sql = f'''
SELECT
t.purpose_cat,
count(1)
FROM ({cat}) AS t
GROUP BY t.purpose_cat
'''
select(sql)

    purpose_cat  count(1)
0        другое         1
1        машина         6
2  недвижимость         2
3       свадьба         5

In [164]:
# что содержит категория `другое`:

sql = f'''select t.purpose, count(1) 

from ({cat}) t
where t.purpose_cat = 'другое'
group by t.purpose
order by count(1) desc'''

select(sql)

             purpose  count(1)
0  возвратить в 2023         1

## Подзапросы

### Обычный подзапрос

In [79]:
# создадим датафрейм:

personal = pd.DataFrame({'id': [1, 1, 1, 2, 2, 3],
                  'name': ['Maria', 'Kate', 'Denis', 'Alex', 'Ivan', 'Julia'],
                 'address':['Gorodetskaya', 'Lenina', 'Kijevatogo', 'Jakuba Kolasa', 'Azgura', 'Krasnayua']})

In [80]:
personal

   id   name        address
0   1  Maria   Gorodetskaya
1   1   Kate         Lenina
2   1  Denis     Kijevatogo
3   2   Alex  Jakuba Kolasa
4   2   Ivan         Azgura
5   3  Julia      Krasnayua

In [81]:
personal.to_sql('staff_info', con, index=False, if_exists='replace')

6

In [82]:
sql = '''
SELECT *
FROM staff_info AS s
'''

In [83]:
select(sql)

   id   name        address
0   1  Maria   Gorodetskaya
1   1   Kate         Lenina
2   1  Denis     Kijevatogo
3   2   Alex  Jakuba Kolasa
4   2   Ivan         Azgura
5   3  Julia      Krasnayua

In [84]:
# SQL-запрос выбирает уникальные id, которые имеют дублирующиеся записи в таблице staff_info и чье кол-во больше 1:

sql = '''
SELECT S.id
FROM staff_info s
GROUP BY s.id
HAVING COUNT(1) > 1
'''

In [85]:
select(sql)

   id
0   1
1   2

In [86]:
# sql- запрос, содержащий внутренний запрос
# результат этого SQL-запроса будет содержать только те строки таблицы staff_info,
# у которых значение столбца id дублируется в этой таблице.

sql = '''
SELECT * 
FROM staff_info s
WHERE s.id IN (SELECT s.id
            FROM staff_info s
           GROUP BY s.id
           HAVING COUNT(1) > 1);

'''

In [87]:
select(sql)

   id   name        address
0   1  Maria   Gorodetskaya
1   1   Kate         Lenina
2   1  Denis     Kijevatogo
3   2   Alex  Jakuba Kolasa
4   2   Ivan         Azgura

In [88]:
# создадим новую таблицу из предыдущей:

sql = '''
DROP table IF EXISTS all_person;

CREATE table all_person AS
SELECT s.id FROM staff_info s
GROUP BY s.id
HAVING COUNT(1) > 1
'''

In [89]:
# ф-ия для выполнения нескольких запросов sql:
cur.executescript(sql)

In [90]:
sql = '''
SELECT * 
FROM all_person t
'''

In [91]:
select(sql)

   id
0   1
1   2

In [92]:
# запрос, оперирующий данными из обеих таблиц:
    
sql = '''
SELECT *
FROM staff_info s
where s.id in all_person;
'''

In [93]:
select(sql)

   id   name        address
0   1  Maria   Gorodetskaya
1   1   Kate         Lenina
2   1  Denis     Kijevatogo
3   2   Alex  Jakuba Kolasa
4   2   Ivan         Azgura

In [94]:
# запрос, использующий временную таблицу(подзапрос):

sql = '''
    SELECT *
    FROM
    (SELECT s.id, COUNT(1) AS count
    FROM staff_info s
    GROUP BY s.id) s

WHERE s.count > 1;
'''

In [95]:
select(sql)

   id  count
0   1      3
1   2      2

### CTE (WITH)

In [96]:
# пример сложного запроса без CTE:
sql = '''
SELECT * 
FROM (

SELECT *
FROM (SELECT s.id,
        COUNT(1) AS count
        FROM staff_info s
        GROUP BY s.id) s

WHERE s.count > 1) s
WHERE s.id = 1;

'''

In [97]:
select(sql)

   id  count
0   1      3

In [98]:
# перепишем запрос с использованием временной таблицы CTE(Common Table Expression):

sql = '''

WITH id_count AS (
SELECT s.id, COUNT(1) AS count FROM staff_info s
GROUP BY s.id),

id_count_2 AS

(SELECT * 
FROM id_count s
WHERE s.count > 1)

SELECT * FROM id_count_2 s
WHERE s.id = 1;

'''

In [99]:
select(sql)

   id  count
0   1      3

## Джойны

### Left JOIN / INNER JOIN

In [100]:
# создадим 2 таблицы:

names = pd.DataFrame({
    'id': [1318, 1282, 3334, 1110],
    'name': ['Koh-i-Noor', 'Einstein', 'Hope', 'Regent']
})

names

     id        name
0  1318  Koh-i-Noor
1  1282    Einstein
2  3334        Hope
3  1110      Regent

In [101]:
items = pd.DataFrame({
    'item_id': [1282, 3334, 1252, 1110],
    'color': ['yellowish', 'colorless', 'blue', 'colorless'],
    'carat':[105.6, 10.64, 45.52, 140.64]
})

items

   item_id      color   carat
0     1282  yellowish  105.60
1     3334  colorless   10.64
2     1252       blue   45.52
3     1110  colorless  140.64

In [102]:
# перевод в sql-таблицы:

names.to_sql('names', con, index=False, if_exists='replace')
items.to_sql('items', con, index=False, if_exists = 'replace')

4

In [103]:
# лефт джоин
sql = '''SELECT d.*, 
        i.color,
        i.carat,
        i.item_id
        FROM items i
        LEFT JOIN names d ON i.item_id = d.id;
'''

In [104]:
select(sql)

       id      name      color   carat  item_id
0  1282.0  Einstein  yellowish  105.60     1282
1  3334.0      Hope  colorless   10.64     3334
2     NaN      None       blue   45.52     1252
3  1110.0    Regent  colorless  140.64     1110

In [105]:
# просто джоин
sql = '''
SELECT d.*, 
        i.*
        FROM names d
        JOIN items i ON d.id = i.item_id;
'''

In [106]:
select(sql)

     id      name  item_id      color   carat
0  1282  Einstein     1282  yellowish  105.60
1  3334      Hope     3334  colorless   10.64
2  1110    Regent     1110  colorless  140.64

In [107]:
#  лефт джоин без учета пропусков:
# d- diamonds
# i-items 

sql = '''SELECT d.*, 
        i.color
        FROM items i
        LEFT JOIN names d ON i.item_id = d.id
        WHERE d.name IS NOT null;
'''

In [108]:
select(sql)

     id      name      color
0  1282  Einstein  yellowish
1  3334      Hope  colorless
2  1110    Regent  colorless

### Джойн таблицы самой на себя (нарастающий итог)

In [109]:
# создадим датафрейм

t = pd.DataFrame({'dt':pd.to_datetime(['2020-03-01','2020-03-02','2020-03-03'], format='%Y-%m-%d'),
                  'revenue':[100, 200, 300]})

In [110]:
t

          dt  revenue
0 2020-03-01      100
1 2020-03-02      200
2 2020-03-03      300

In [111]:
# перевод таблицы в базу данных c помощью sql:

t.to_sql('revenue', con, index=False, if_exists='replace')

3

In [112]:
# вывод кумулятивной суммы выручки:

sql = '''SELECT 
        t.dt,
        t.revenue,
        SUM(r.revenue) as CUMSUM FROM revenue t
        JOIN revenue r ON r.dt <= t.dt 
        GROUP BY t.dt, t.revenue;
        
'''

In [113]:
select(sql)

                    dt  revenue  CUMSUM
0  2020-03-01 00:00:00      100     100
1  2020-03-02 00:00:00      200     300
2  2020-03-03 00:00:00      300     600

### Ежемесячный отчет на пользователя

In [114]:
# воспользуемся готовой таблицей с данными клиентов о транзакциях:

transactions = pd.read_csv('./german_credit_augmented_transactions.csv')
transactions.head(10)

                    dt  client_id    amount
0  2008-04-06 11:54:47        950    161.38
1  2007-07-28 00:00:19        418     35.34
2  2008-03-14 20:43:54        131    146.50
3  2007-12-18 13:03:24        353    119.21
4  2007-11-09 05:18:30        849    105.24
5  2008-01-24 23:02:24        999    164.94
6  2007-12-24 16:28:30        938   1044.00
7  2007-05-07 17:46:15        568     98.39
8  2008-05-31 13:02:21        365  10049.10
9  2008-05-09 10:01:21        961    182.82

In [115]:
transactions.to_sql('client_transactions', con, index=False, if_exists='replace')

4275

In [116]:
sql = '''
SELECT *
FROM client_transactions c
LIMIT 5;
'''

In [117]:
select(sql)

                    dt  client_id  amount
0  2008-04-06 11:54:47        950  161.38
1  2007-07-28 00:00:19        418   35.34
2  2008-03-14 20:43:54        131  146.50
3  2007-12-18 13:03:24        353  119.21
4  2007-11-09 05:18:30        849  105.24

In [118]:
# выведем сумму транзакций (`transaction_sum`) для каждого клиента по месяцам:
# отсортируем по первым 1-ому столбцу
# отсортируем по столбцу 1 - дате:

sql = '''
SELECT 
DATE(c.dt, 'start of month') AS month,
c.client_id,
COUNT(1) AS transaction_cnt,
SUM(c.amount) AS transaction_sum

FROM client_transactions c
GROUP BY 1 
ORDER BY 1;

'''

In [119]:
select(sql)

         month  client_id  transaction_cnt  transaction_sum
0   2007-05-01        568              338        450912.77
1   2007-06-01        603              379        551664.83
2   2007-07-01        418              304        494134.50
3   2007-08-01        443              255        426903.23
4   2007-10-01        900              332        634846.49
5   2007-11-01        849              389        500420.98
6   2007-12-01        353              364        561449.89
7   2008-01-01        999              413        630137.22
8   2008-02-01        909              228        337043.47
9   2008-03-01        131              309        425599.09
10  2008-04-01        950              383        677194.97
11  2008-05-01        365              310        474962.34
12  2008-06-01        844              271        383710.84

Выведем минимальные и максимальный месяц:

In [120]:
min = '''
SELECT DATE(min(c.dt),'start of month') AS MIN_MONTH
FROM client_transactions c;
'''

In [121]:
max = '''
SELECT DATE(max(c.dt), 'start of month') AS MAX_MONTH
FROM client_transactions c;
'''

In [122]:
select(min)

    MIN_MONTH
0  2007-05-01

In [123]:
select(max)

    MAX_MONTH
0  2008-06-01

## Оконные функции

### Пример оконной функции

In [124]:
sql = '''SELECT * FROM diamonds_for_sql
'''

pd.read_sql(sql, con)

       carat        cut color clarity  depth  table  price     x     y     z
0       0.23      Ideal     E     SI2   61.5   55.0    326  3.95  3.98  2.43
1       0.21    Premium     E     SI1   59.8   61.0    326  3.89  3.84  2.31
2       0.23       Good     E     VS1   56.9   65.0    327  4.05  4.07  2.31
3       0.29    Premium     I     VS2   62.4   58.0    334  4.20  4.23  2.63
4       0.31       Good     J     SI2   63.3   58.0    335  4.34  4.35  2.75
...      ...        ...   ...     ...    ...    ...    ...   ...   ...   ...
53789   0.72      Ideal     D     SI1   60.8   57.0   2757  5.75  5.76  3.50
53790   0.72       Good     D     SI1   63.1   55.0   2757  5.69  5.75  3.61
53791   0.70  Very Good     D     SI1   62.8   60.0   2757  5.66  5.68  3.56
53792   0.86    Premium     H     SI2   61.0   58.0   2757  6.15  6.12  3.74
53793   0.75      Ideal     D     SI2   62.2   55.0   2757  5.83  5.87  3.64

[53794 rows x 10 columns]

In [125]:
# выведем суммарный прайс, сформированный по окну 'cut':

sql = '''
SELECT d.*,
SUM(d.price) OVER (PARTITION BY d.cut) AS cum_price
FROM diamonds_for_sql d'''

In [126]:
select(sql)

,carat,cut,color,clarity,depth,table,price,x,y,z,cum_price
0,0.22,Fair,E,VS2,65.1,61.0,337,3.87,3.78,2.49,6938443
1,0.86,Fair,E,SI2,55.1,69.0,2757,6.45,6.33,3.52,6938443
2,0.96,Fair,F,SI2,66.3,62.0,2759,6.27,5.95,4.07,6938443
3,0.70,Fair,F,VS2,64.5,57.0,2762,5.57,5.53,3.58,6938443
4,0.70,Fair,F,VS2,65.3,55.0,2762,5.63,5.58,3.66,6938443
...,...,...,...,...,...,...,...,...,...,...,...
53789,0.70,Very Good,E,VS2,62.8,60.0,2755,5.59,5.65,3.53,48046884
53790,0.70,Very Good,D,VS1,63.1,59.0,2755,5.67,5.58,3.55,48046884
53791,0.70,Very Good,E,VS2,60.5,59.0,2757,5.71,5.76,3.47,48046884
53792,0.70,Very Good,E,VS2,61.2,59.0,2757,5.69,5.72,3.49,48046884
53793,0.70,Very Good,D,SI1,62.8,60.0,2757,5.66,5.68,3.56,48046884

In [127]:
# выведем средний прайс в зависимости от веса и цвета алмазов:

sql = '''SELECT *,
AVG(price) OVER(PARTITION BY d.carat, d.color ) AS avg_price

FROM diamonds_for_sql d
ORDER BY d.carat desc;

'''

In [128]:
select(sql)

,carat,cut,color,clarity,depth,table,price,x,y,z,avg_price
0,5.01,Fair,J,I1,65.5,59.0,18018,10.74,10.54,6.98,18018.00
1,4.50,Fair,J,I1,65.8,58.0,18531,10.23,10.16,6.72,18531.00
2,4.13,Fair,H,I1,64.8,61.0,17329,10.00,9.85,6.43,17329.00
3,4.01,Premium,I,I1,61.0,61.0,15223,10.14,10.10,6.17,15223.00
4,4.01,Premium,J,I1,62.5,62.0,15223,10.02,9.94,6.24,15223.00
...,...,...,...,...,...,...,...,...,...,...,...
53789,0.20,Premium,E,VS2,59.7,62.0,367,3.84,3.80,2.28,364.25
53790,0.20,Ideal,E,VS2,59.7,55.0,367,3.86,3.84,2.30,364.25
53791,0.20,Very Good,E,VS2,63.4,59.0,367,3.74,3.71,2.36,364.25
53792,0.20,Ideal,E,VS2,62.2,57.0,367,3.76,3.73,2.33,364.25
53793,0.20,Premium,F,VS2,62.6,59.0,367,3.73,3.71,2.33,367.00

### Rank и Row_number¶

In [129]:
#создадим датафрейм:

income = pd.DataFrame({'user_id':[1,1,1,2,2,2,2],'date':pd.to_datetime(['2020-04-01','2020-04-02','2020-04-03','2020-04-03',
                                                               '2020-04-03','2020-04-04','2020-04-05'],format='%Y-%m-%d'),
                  'income':[1,3,1,5,2,3,4]})

In [130]:
income.to_sql('income', con, index=False, if_exists='replace')

7

In [131]:
sql = '''
SELECT * FROM income i
'''

In [132]:
select(sql)

   user_id                 date  income
0        1  2020-04-01 00:00:00       1
1        1  2020-04-02 00:00:00       3
2        1  2020-04-03 00:00:00       1
3        2  2020-04-03 00:00:00       5
4        2  2020-04-03 00:00:00       2
5        2  2020-04-04 00:00:00       3
6        2  2020-04-05 00:00:00       4

In [133]:
# выполним выборку данных из таблицы 'income' и создадим новый столбец "rnk". 
# В нем ранг (порядковый номер) каждой строки внутри каждой группы пользователей (по столбцу "user_id"),
# упорядоченных по столбцу "date" в убывающем (DESC) порядке.

sql = '''SELECT i.*,

RANK() OVER (PARTITION BY i.user_id ORDER BY i.date DESC) AS rnk

FROM income i'''

In [134]:
select(sql)

   user_id                 date  income  rnk
0        1  2020-04-03 00:00:00       1    1
1        1  2020-04-02 00:00:00       3    2
2        1  2020-04-01 00:00:00       1    3
3        2  2020-04-05 00:00:00       4    1
4        2  2020-04-04 00:00:00       3    2
5        2  2020-04-03 00:00:00       5    3
6        2  2020-04-03 00:00:00       2    3

In [135]:
# запрос с подзапросом, в результате которого получаем записи с присвоенным рангом 1:

sql = '''
WITH date_rank AS(

SELECT d.*,

ROW_NUMBER() OVER (PARTITION BY d.user_id ORDER BY d.date DESC) AS rnk

FROM income d)
 
 SELECT *
 FROM date_rank t
 
WHERE t.rnk = 1
 
 '''

In [136]:
select(sql)

   user_id                 date  income  rnk
0        1  2020-04-03 00:00:00       1    1
1        2  2020-04-05 00:00:00       4    1

 ### Поиск топ-3 зарплаты в отделе с помощью  DENSE_RANK()

 Найдем три самых высоких зарплаты в отделе с использованием Dense_Rank:

In [137]:
# создадим датафрейм:

sal = pd.DataFrame({'department':['a','a','a','a','a',
                         'b','b','b','b','b'],
                  'employee_id':[1113, 1218, 6364, 1732, 1214,
                         1517, 1110, 9998, 9997, 9765],
                  'salary':[5, 5, 4, 2, 1,
                         5, 4, 3, 2, 1]})

In [138]:
sal

  department  employee_id  salary
0          a         1113       5
1          a         1218       5
2          a         6364       4
3          a         1732       2
4          a         1214       1
5          b         1517       5
6          b         1110       4
7          b         9998       3
8          b         9997       2
9          b         9765       1

In [139]:
sal.to_sql('salary', con, index=False, if_exists = 'replace')

10

In [140]:
# сравним результат ранжирования ф-ий rank и dense_rank:

sql = '''SELECT s.*,
RANK() OVER (PARTITION BY s.department ORDER BY s.salary DESC) AS rank,
DENSE_RANK() OVER (PARTITION BY s.department ORDER BY s.salary DESC) AS dns_rnk

FROM salary s;
'''

In [141]:
select(sql)

  department  employee_id  salary  rank  dns_rnk
0          a         1113       5     1        1
1          a         1218       5     1        1
2          a         6364       4     3        2
3          a         1732       2     4        3
4          a         1214       1     5        4
5          b         1517       5     1        1
6          b         1110       4     2        2
7          b         9998       3     3        3
8          b         9997       2     4        4
9          b         9765       1     5        5

In [142]:
# используем dense_rank для поиска топ-3 зарплат в каждом из отделов:

sql = '''

WITH salary_rnk AS (

SELECT s.*,
DENSE_RANK() OVER (PARTITION BY s.department ORDER BY s.salary DESC) AS dns_rnk
FROM salary s)
 
 SELECT * 
 FROM salary_rnk s
 WHERE s.dns_rnk <= 3;
 
 '''

In [143]:
select(sql)

  department  employee_id  salary  dns_rnk
0          a         1113       5        1
1          a         1218       5        1
2          a         6364       4        2
3          a         1732       2        3
4          b         1517       5        1
5          b         1110       4        2
6          b         9998       3        3

### Работа с клиентскими сессиями с помощью LAG()

Cоздадим три датафрейма и затем объединим их в один для удобства:

In [144]:
user1 = pd.DataFrame({'user_id':[1,1,1,1,1],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 12:31',
                                       '2021-04-03 07:31'],format='%Y-%m-%d %H:%M')})

In [145]:
user2 = pd.DataFrame({'user_id':[2,2,2,2],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 9:10',
                                       ],format='%Y-%m-%d %H:%M')})

In [146]:
user3 = pd.DataFrame({'user_id':[3,3,3],
                  'dt':pd.to_datetime(['2021-04-01 07:31','2021-04-02 07:35',
                                       '2021-04-03 08:20'
                                       ],format='%Y-%m-%d %H:%M')})

In [147]:
df = pd.concat([user1,user2,user3])

In [148]:
df.to_sql('client_log', con, index=False, if_exists='replace')

12

In [149]:
sql = '''SELECT * FROM client_log t'''

In [150]:
select(sql)

    user_id                   dt
0         1  2021-04-01 07:31:00
1         1  2021-04-01 07:35:00
2         1  2021-04-01 08:20:00
3         1  2021-04-01 12:31:00
4         1  2021-04-03 07:31:00
5         2  2021-04-01 07:31:00
6         2  2021-04-01 07:35:00
7         2  2021-04-01 08:20:00
8         2  2021-04-01 09:10:00
9         3  2021-04-01 07:31:00
10        3  2021-04-02 07:35:00
11        3  2021-04-03 08:20:00

Будем считать длительность одной сесии равной 60*60 = 3600 секунд:

In [151]:
# расчитаем общее количество уникальных клиентских сессий:

sql = '''
 WITH new_session AS (
SELECT t.*,

LAG(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt) AS prev_dt,

ROUND((julianday(t.dt) - julianday(LAG(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt))) * 24 * 60 * 60) AS dt_diff,

    CASE 
WHEN ROUND((julianday(t.dt) - julianday(LAG(t.dt) OVER (PARTITION BY t.user_id ORDER BY t.dt))) * 24 * 60 * 60) >= 3600
    THEN 1
    ELSE 0 
    END
    AS new_session FROM client_log t),
    

 client_sessions AS (
 
 SELECT t.*,
 
 SUM(t.new_session) OVER (PARTITION BY t.user_id ORDER BY t.dt) AS session_id
 
 FROM new_session t),
 

client_sessions_agg AS (

  SELECT t.user_id, t.session_id, COUNT(1) as action_cnt FROM client_sessions t
  GROUP BY t.user_id, t.session_id)


  SELECT COUNT(*) AS unique_amount
  FROM client_sessions_agg t
 
 '''

In [152]:
select(sql)

   unique_amount
0              7

### Скользящее среднее

In [153]:
# создадим датафрейм:

data = pd.DataFrame({'user_id':[1,1,1,1,1,1,
                             2,2,2,2,2],
                  'dt': pd.to_datetime(['2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 12:31',
                                       '2021-04-03 07:31', '2021-04-01 07:31','2021-04-01 07:35',
                                       '2021-04-01 08:20','2021-04-01 9:10','2021-04-02 07:35',
                                       '2021-04-03 08:20'], format='%Y-%m-%d %H:%M'),
                  'revenue':[1,2,3,4,5,6,
                             3,4,5,6,7]})

In [154]:
data.to_sql('revenue',con,index=False,if_exists='replace')

11

In [155]:
sql = '''
SELECT t.*,

AVG(t.revenue) OVER (ORDER BY t.dt ROWS BETWEEN 2 PRECEDING AND 2 FOLLOWING

) AS moving_avg

FROM revenue t;
'''

In [156]:
select(sql)

    user_id                   dt  revenue  moving_avg
0         1  2021-04-01 07:31:00        1         3.0
1         1  2021-04-01 07:31:00        6         3.0
2         1  2021-04-01 07:35:00        2         3.0
3         2  2021-04-01 07:35:00        3         3.6
4         1  2021-04-01 08:20:00        3         3.4
5         2  2021-04-01 08:20:00        4         3.8
6         2  2021-04-01 09:10:00        5         4.4
7         1  2021-04-01 12:31:00        4         4.8
8         2  2021-04-02 07:35:00        6         5.4
9         1  2021-04-03 07:31:00        5         5.5
10        2  2021-04-03 08:20:00        7         6.0